patrickf1/fzf.fish
pure-fish/pure
jorgebucaran/hydro
ilancosman/tide@v6
mattgreen/lucid.fish
jorgebucaran/fisher
fabioantunes/fish-nvm
edc/bass
