tap "chase/tap"
tap "daipeihust/tap"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jonz94/sarasa-nerd-fonts"
tap "krtirtho/apps"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "nikitabobko/tap"
tap "samtay/tui"
tap "sergiobenitez/osxct"
tap "teamookla/speedtest"
tap "th-ch/youtube-music"
tap "yakitrak/yakitrak"
tap "yt-dlp/taps"
brew "libtiff"
brew "gettext"
brew "openssl@3"
brew "python-packaging"
brew "autoconf"
brew "automake"
brew "libssh2"
brew "bat"
brew "btop"
brew "python@3.12"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "cbonsai"
brew "chezmoi"
brew "cloc"
brew "cocoapods"
brew "convmv"
brew "rtmpdump"
brew "curl"
brew "dust"
brew "fastfetch"
brew "fd"
brew "srt"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fisher"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gping"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "helix"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "less"
brew "llvm"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "lynx"
brew "mackup"
brew "meson"
brew "mingw-w64"
brew "mplayer"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv", args: ["HEAD"]
brew "mycli"
brew "mysql@8.0", restart_service: true
brew "neovim"
brew "node"
brew "nushell"
brew "nvm"
brew "openldap"
brew "pillow"
brew "pipenv"
brew "pkgconf"
brew "poppler"
brew "powerlevel10k"
brew "pure"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rm-improved"
brew "rustup"
brew "sevenzip"
brew "smartmontools"
brew "spotify_player"
brew "spotifyd", restart_service: true
brew "sqlfluff"
brew "testdisk"
brew "tlrc"
brew "tmux"
brew "tree"
brew "ttfautohint"
brew "unar"
brew "vite"
brew "w3m"
brew "walk"
brew "wget"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "chase/tap/awrit"
brew "daipeihust/tap/im-select"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "samtay/tui/tetris"
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
brew "teamookla/speedtest/speedtest"
brew "yakitrak/yakitrak/obsidian-cli"
cask "aerospace"
cask "alacritty"
cask "amethyst"
cask "bruno"
cask "chatgpt"
cask "dbeaver-community"
cask "flutter"
cask "font-sarasa-mono-k-nerd-font"
cask "free-ruler"
cask "hiddenbar"
cask "iterm2"
cask "marta"
cask "mysqlworkbench"
cask "neovide"
cask "notunes"
cask "openinterminal"
cask "qview"
cask "spotify"
cask "spotube"
cask "wezterm"
cask "youtube-music"
cask "ytmdesktop-youtube-music"
cask "zulu"
cask "zulu@8"
