tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "nikitabobko/tap"
tap "sergiobenitez/osxct"
tap "teamookla/speedtest"
tap "th-ch/youtube-music"
tap "yt-dlp/taps"
brew "libtiff"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "libssh2"
brew "bat"
brew "broot"
brew "gcc"
brew "btop"
brew "gettext"
brew "python@3.12"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "chezmoi"
brew "cloc"
brew "cocoapods"
brew "rtmpdump"
brew "curl"
brew "dust"
brew "fd"
brew "icu4c"
brew "srt"
brew "ffmpeg"
brew "python-packaging"
brew "ffmpegthumbnailer"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gping"
brew "helix"
brew "httpie"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "less"
brew "lsd"
brew "lua"
brew "meson"
brew "mingw-w64"
brew "mplayer"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv", args: ["HEAD"]
brew "neovim"
brew "nnn"
brew "node"
brew "nushell"
brew "nvm"
brew "openldap"
brew "pillow"
brew "poppler"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rm-improved"
brew "smartmontools"
brew "testdisk"
brew "tlrc"
brew "tmux"
brew "tree"
brew "unar"
brew "vite"
brew "walk"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "gromgit/fuse/ntfs-3g-mac"
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
brew "teamookla/speedtest/speedtest"
cask "aerospace"
cask "chatgpt"
cask "flutter"
cask "hiddenbar"
cask "iterm2"
cask "openinterminal"
cask "qview"
cask "youtube-music"
cask "zulu"
cask "zulu@8"
